puts "Install XCode? y or n"
xcode = STDIN.gets.chomp

puts "Install Docker? y or n"
docker = STDIN.gets.chomp

tap "beeftornado/rmtree"
tap "clementtsang/bottom"
tap "cormacrelf/tap"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "jryom/homebrew-formulae"
tap "koekeishiya/formulae"
tap "ojford/formulae"

brew "antibody"
brew "bat"
brew "bottom"
brew "brew-rmtree"
brew "coreutils"
brew "dark-mode"
brew "dark-notify"
brew "exa"
brew "findutils"
brew "fnm"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "go"
brew "googler"
brew "hadolint"
brew "hub"
brew "jq"
brew "lazygit"
brew "lf"
brew "markdownlint-cli"
brew "neovim"
brew "pastel"
brew "pure"
brew "python"
brew "rbenv"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "skhd"
brew "so"
brew "stow"
brew "stylua"
brew "terminal-notifier"
brew "tldr"
brew "trash"
brew "tree"
brew "vint"
brew "watchexec"
brew "watchman"
brew "yabai"
brew "z"
brew "zsh"

cask_args force: true

cask "1password"
cask "aldente"
cask "appcleaner"
cask "bartender"
cask "choosy"
cask "firefox"
cask "font-iosevka"
cask "google-chrome"
cask "istat-menus"
cask "itsycal"
cask "keepingyouawake"
cask "kitty"
cask "launchcontrol"
cask "mullvadvpn"
cask "omnidisksweeper"
cask "sonos"
cask "spaceid"
cask "spotify"
cask "sublime-merge"

mas "Dark Reader for Safari", id: 1438243180
mas "NextDNS", id: 1464122853
mas "Noizio", id: 928871589
mas "Tampermonkey", id: 1482490089
mas "Vimari", id: 1480933944

if xcode == "y"
  mas "Xcode", id: 497799835
end

if docker == "y"
  cask "docker"
end
