tap "heroku/brew"
tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"

brew "bat"
brew "coreutils"
brew "dark-mode"
brew "dtach"
brew "exa"
brew "fish"
brew "fzf"
brew "git"
brew "gnu-sed"
brew "heroku"
brew "hub"
brew "jq"
brew "lf"
brew "moreutils"
brew "ncurses"
brew "neovim"
brew "python"
brew "ripgrep"
brew "ruby"
brew "schniz/tap/fnm"
brew "skhd"
brew "terminal-notifier"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "yabai"

cask_args force: true
cask "1password"
cask "alfred"
cask "appcleaner"
cask "authy"
cask "bartender"
cask "docker"
cask "firefox"
cask "flux"
cask "font-iosevka"
cask "google-chrome"
cask "graphiql"
cask "iina"
cask "istat-menus"
cask "itsycal"
cask "jesperryom/tap/spaceid"
cask "kitty"
cask "launchcontrol"
cask "linear"
cask "nativedisplaybrightness"
cask "spotmenu"
cask "sublime-merge"
cask "sublime-text"
cask "whatsapp"

mas "Noizio", id: 928871589
mas "Xcode", id: 497799835
