brew "Schniz/tap/fnm"
brew "bat"
brew "coreutils"
brew "dark-mode"
brew "exa"
brew "fd"
brew "fish"
brew "fzf"
brew "git"
brew "heroku/brew/heroku"
brew "jesseduffield/lazygit/lazygit"
brew "jq"
brew "neovim"
brew "nnn"
brew "python"
brew "python@2"
brew "ruby"
brew "the_silver_searcher"
brew "tree"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "yamllint"
cask "amethyst"
