tap "beeftornado/rmtree"
tap "getantibody/tap"
tap "heroku/brew"
tap "homebrew/cask-fonts"
tap "jesperryom/tap"
tap "koekeishiya/formulae"
tap "nextdns/tap"
tap "ojford/formulae"
tap "schniz/tap"

brew "antibody"
brew "bat"
brew "brew-rmtree"
brew "coreutils"
brew "dark-mode"
brew "fnm"
brew "fzf"
brew "git"
brew "gnu-sed"
brew "heroku"
brew "hub"
brew "jq"
brew "lf"
brew "loginitems"
brew "moreutils"
brew "python"
brew "ripgrep"
brew "ruby"
brew "skhd"
brew "terminal-notifier"
brew "tldr"
brew "tree"
brew "vim"
brew "yabai"

cask_args force: true
cask "1password"
cask "appcleaner"
cask "bartender"
cask "firefox"
cask "flux"
cask "font-iosevka"
cask "google-chrome"
cask "iina"
cask "istat-menus"
cask "itsycal"
cask "kitty"
cask "launchcontrol"
cask "mullvadvpn"
cask "spaceid"
cask "spotify"
cask "spotmenu"
cask "sublime-merge"
cask "sublime-text"
cask "whatsapp"
