tap "beeftornado/rmtree"
tap "clementtsang/bottom"
tap "cormacrelf/tap"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"
tap "ojford/formulae"

brew "act"
brew "actionlint"
brew "bash"
brew "bat"
brew "brew-rmtree"
brew "coreutils"
brew "dark-mode"
brew "dark-notify"
brew "direnv"
brew "dotenv-linter"
brew "efm-langserver"
brew "erdtree"
brew "exa"
brew "fd"
brew "findutils"
brew "fish"
brew "fisher"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnu-sed"
brew "gopls"
brew "hadolint"
brew "hub"
brew "jq"
brew "just"
brew "lazygit"
brew "lf"
brew "lua-language-server"
brew "mas"
brew "media-info"
brew "moreutils"
brew "ncdu"
brew "neovim"
brew "pastel"
brew "pyenv"
brew "python"
brew "rbenv"
brew "ripgrep"
brew "sheldon"
brew "shellcheck"
brew "shfmt"
brew "skhd"
brew "so"
brew "starship"
brew "stow"
brew "stylua"
brew "terminal-notifier"
brew "tldr"
brew "trash"
brew "tree"
brew "watchexec"
brew "yabai"
brew "yamllint"
brew "zoxide"

cask_args force: true

cask "aldente"
cask "appcleaner"
cask "bartender"
cask "choosy"
cask "firefox"
cask "font-iosevka"
cask "font-symbols-only-nerd-font"
cask "google-chrome"
cask "istat-menus"
cask "keepingyouawake"
cask "kitty"
cask "meetingbar"
cask "miniforge"
cask "omnidisksweeper"
cask "sonos"
cask "spaceid"
cask "spotify"
cask "sublime-merge"

mas "Dark Reader for Safari", id: 1438243180
mas "NextDNS", id: 1464122853
mas "Noizio", id: 928871589
mas "Vimari", id: 1480933944

if ENV["XCODE"]
  mas "Xcode", id: 497799835
end

if ENV["DOCKER"]
  cask "docker"
end
