tap "azure/functions"
tap "domt4/autoupdate"
tap "heroku/brew"
tap "homebrew/cask-fonts"

brew "azure-functions-core-tools"
brew "Schniz/tap/fnm"
brew "bat"
brew "coreutils"
brew "dark-mode"
brew "exa"
brew "fish"
brew "fzf"
brew "git"
brew "heroku"
brew "hub"
brew "lazygit"
brew "jq"
brew "jsonlint"
brew "koekeishiya/formulae/chunkwm"
brew "koekeishiya/formulae/skhd"
brew "lf"
brew "neovim"
brew "prettier"
brew "python"
brew "python"
brew "python@2"
brew "ripgrep"
brew "ruby"
brew "tree"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "yamllint"

cask_args force: true
cask "1password"
cask "appcleaner"
cask "authy"
cask "docker"
cask "dropbox"
cask "firefox"
cask "flux"
cask "font-iosevka-nerd-font"
cask "google-chrome"
cask "graphiql"
cask "iina"
cask "istat-menus"
cask "itsycal"
cask "kitty"
cask "linear"
cask "nativedisplaybrightness"
cask "onyx"
cask "postman"
cask "private-internet-access"
cask "slack"
cask "spotify"
cask "spotmenu"
cask "sublime-merge"
cask "sublime-text"
cask "the-unarchiver"
cask "whatsapp"

mas "Noizio", id: 928871589
mas "Xcode", id: 497799835
