tap "heroku/brew"
tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"

brew "bat"
brew "coreutils"
brew "dark-mode"
brew "exa"
brew "fd"
brew "fish"
brew "fzf"
brew "git"
brew "gnu-sed"
brew "heroku"
brew "hub"
brew "jq"
brew "lf"
brew "neovim"
brew "python"
brew "python@2"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "ruby"
brew "schniz/tap/fnm"
brew "skhd"
brew "tmux"
brew "yabai"

cask_args force: true
cask "appcleaner"
cask "authy"
cask "bartender"
cask "docker"
cask "dropbox"
cask "firefox"
cask "flux"
cask "font-iosevka"
cask "google-chrome"
cask "graphiql"
cask "iina"
cask "istat-menus"
cask "itsycal"
cask "jesperryom/tap/spaceid"
cask "kitty"
cask "linear"
cask "nativedisplaybrightness"
cask "onyx"
cask "private-internet-access"
cask "spotify"
cask "spotmenu"
cask "sublime-merge"
cask "sublime-text"

mas "1Password 7 - Password Manager", id:1333542190
mas "Noizio", id: 928871589
mas "Slack", id: 803453959
mas "WhatsApp Desktop", id: 1147396723
mas "Xcode", id: 497799835
