tap "beeftornado/rmtree"
tap "cormacrelf/tap"
tap "hudochenkov/sshpass"

brew "aichat"
brew "bash"
brew "bat"
brew "beeftornado/rmtree/brew-rmtree"
brew "coreutils"
brew "cormacrelf/tap/dark-notify"
brew "dash"
brew "delta"
brew "eza"
brew "fd"
brew "findutils"
brew "fish"
brew "fisher"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "hub"
brew "hudochenkov/sshpass/sshpass"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "lf"
brew "mas"
brew "mise"
brew "moreutils"
brew "ncdu"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "tealdeer"
brew "tmux"
brew "trash"
brew "zoxide"

cask_args force: true

cask "1password"
cask "aldente"
cask "appcleaner"
cask "docker", greedy: true
cask "firefox", greedy: true
cask "font-iosevka"
cask "gitify"
cask "itsycal"
cask "jordanbaird-ice"
cask "keepingyouawake"
cask "kitty"
cask "nikitabobko/tap/aerospace"
cask "postman", greedy: true
cask "reminders-menubar"
cask "sonos"
cask "spotify"
cask "spotmenu"

mas "NextDNS", id: 1464122853
