tap "beeftornado/rmtree"
tap "cormacrelf/tap"
tap "hashicorp/tap"
tap "hudochenkov/sshpass"
tap "jonaslu/tools"
tap "koekeishiya/formulae"

brew "actionlint"
brew "bash"
brew "bat"
brew "beeftornado/rmtree/brew-rmtree"
brew "checkmake"
brew "coreutils"
brew "cormacrelf/tap/dark-notify"
brew "dark-mode"
brew "dash"
brew "difftastic"
brew "direnv"
brew "dotenv-linter"
brew "fd"
brew "findutils"
brew "fish"
brew "fisher"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "gopls"
brew "gpg"
brew "hadolint"
brew "hashicorp/tap/terraform-ls"
brew "hub"
brew "hudochenkov/sshpass/sshpass"
brew "j178/tap/chatgpt"
brew "jq"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "lazygit"
brew "lf"
brew "lua-language-server"
brew "mas"
brew "media-info"
brew "mise"
brew "moreutils"
brew "ncdu"
brew "neovim"
brew "pnpm"
brew "postgresql@16"
brew "proctools"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "sshpass"
brew "stylua"
brew "tealdeer"
brew "terminal-notifier"
brew "trash"
brew "tree"
brew "watchexec"
brew "zoxide"

cask_args force: true

cask "1password"
cask "aldente"
cask "appcleaner"
cask "darkmodebuddy"
cask "docker"
cask "firefox"
cask "font-iosevka"
cask "font-iosevka-term-nerd-font"
cask "gitify"
cask "istat-menus"
cask "itsycal"
cask "jordanbaird-ice"
cask "keepingyouawake"
cask "kitty"
cask "postman"
cask "reminders-menubar"
cask "sonos"
cask "spotify"
cask "spotmenu"
cask "ukelele"

mas "Dark Reader for Safari", id: 1438243180
mas "NextDNS", id: 1464122853
