tap "beeftornado/rmtree"
tap "cormacrelf/tap"
tap "hashicorp/tap"
tap "homebrew/cask-fonts"
tap "hudochenkov/sshpass"
tap "j178/tap"
tap "jonaslu/tools"
tap "koekeishiya/formulae"

brew "actionlint"
brew "bash"
brew "bat"
brew "beeftornado/rmtree/brew-rmtree"
brew "coreutils"
brew "cormacrelf/tap/dark-notify"
brew "dark-mode"
brew "dash"
brew "direnv"
brew "dotenv-linter"
brew "fd"
brew "findutils"
brew "fish"
brew "fisher"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gnu-sed"
brew "gopls"
brew "hadolint"
brew "hashicorp/tap/terraform-ls"
brew "hub"
brew "hudochenkov/sshpass/sshpass"
brew "j178/tap/chatgpt"
brew "jonaslu/tools/ain"
brew "jq"
brew "just"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "lazygit"
brew "lf"
brew "lua-language-server"
brew "mas"
brew "media-info"
brew "mise"
brew "moreutils"
brew "ncdu"
brew "neovim"
brew "pnpm"
brew "postgresql@16"
brew "proctools"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "stylua"
brew "tealdeer"
brew "terminal-notifier"
brew "trash"
brew "tree"
brew "watchexec"
brew "zoxide"

cask_args force: true

cask "aldente"
cask "appcleaner"
cask "bartender"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "homebrew/cask-fonts/font-iosevka"
cask "homebrew/cask-fonts/font-iosevka-term-nerd-font"
cask "istat-menus"
cask "itsycal"
cask "keepingyouawake"
cask "kitty"
cask "sonos"
cask "spotify"

mas "Dark Reader for Safari", id: 1438243180
mas "NextDNS", id: 1464122853

if ENV["XCODE"]
  mas "Xcode", id: 497799835
end

if ENV["PERSONAL"]
  cask "ableton-live-suite"
  cask "audacity"
  cask "fabfilter-pro-c"
  cask "fabfilter-pro-mb"
  cask "fabfilter-pro-q"
  cask "fabfilter-pro-r"
  cask "fabfilter-saturn"
  cask "fabfilter-timeless"
  cask "fabfilter-volcano"
  cask "focusrite-control"
  cask "iina"
  cask "ilok-license-manager"
  cask "native-access"
  cask "onyx"
  cask "selfcontrol"
  cask "softube-central"
  cask "splice"
end
