brew "id3lib"
brew "sox"

cask_args force: true

cask "1password"
cask "ableton-live-suite"
cask "aldente"
cask "appcleaner"
cask "arturia-software-center"
cask "audacity"
cask "fabfilter-pro-c"
cask "fabfilter-pro-l"
cask "fabfilter-pro-mb"
cask "fabfilter-pro-q"
cask "fabfilter-pro-r"
cask "fabfilter-saturn"
cask "fabfilter-timeless"
cask "fabfilter-volcano"
cask "focusrite-control"
cask "iina"
cask "ilok-license-manager"
cask "native-access"
cask "selfcontrol"
cask "softube-central"
cask "sonos"
cask "splice"
cask "synology-drive"
cask "tailscale"

mas "NextDNS", id: 1464122853
