changyuheng/zsh-interactive-cd
djui/alias-tips
ohmyzsh/ohmyzsh path:plugins/per-directory-history
mafredri/zsh-async
ohmyzsh/ohmyzsh path:plugins/gnu-utils
sindresorhus/pure
zsh-users/zsh-autosuggestions
zsh-users/zsh-completions
zsh-users/zsh-syntax-highlighting
